# Area Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSegment..::..Area Property
MEPAnalyticalSegment Class See Also
---
The area of the segment profile.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace